Revit 2024 API
NumberSystem.NumberedElementId Property
 The LinkElementId of the numbered host element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public LinkElementId NumberedElementId { get; }
Visual Basic
Public ReadOnly Property NumberedElementId As LinkElementId
	Get
Visual C++
public:
property LinkElementId^ NumberedElementId {
	LinkElementId^ get ();
}
See Also
NumberSystem Class
Autodesk.Revit.DB Namespace